# ProfileType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..ProfileType Property
PartMakerMethodToDivideVolumes Class See Also
---
The id of the profile family applied to boundaries between parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ProfileType { get; set; }
```

Visual Basic
---
```text
Public Property ProfileType As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ProfileType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace